app/controllers/activations_controller.rb

SELECT * FROM `users` WHERE (perishable_token = 'qRCwLtS2OZOVAabJM6HS' and updated_at > '2010-10-30 00:09:34') LIMIT 1
---
  def create
    @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise Exception)