app/controllers/password_resets_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'lu.lee@sfss') LIMIT 1
---
  def create
    @user = User.find_by_email(params[:email])

UPDATE `users` SET `updated_at` = '2010-11-06 00:47:06', `crypted_password` = '9c0ae48811ffdd0ceeda443f2c804058a40af765d73ea4689231e5868c7ce003bd2d3c697b3910b42bbdf321247a902de43c22b84136e42bc0848df76cb0e521', `salt` = 'w4p2EAe6sX9rez8CZjBx', `perishable_token` = 'Vq87if6ZkFn0WMTYmTq', `last_login_at` = '2010-11-06 00:09:54', `current_login_at` = '2010-11-06 00:47:06', `login_count` = 3, `persistence_token` = '757693a75db1a293d5a67aea1e13ca2abb0068011d628bb644b51d529b6aa20fd31e05a0cbce330058d160c1a48dcee0f77724db1f592b931129b23379e8874a', `last_request_at` = '2010-11-06 00:47:06' WHERE `id` = 1
---
  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save

SELECT * FROM `users` WHERE (perishable_token = 'NuCJjpQUswRao0tjQRP' and updated_at > '2010-11-06 00:36:58') LIMIT 1
---
  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])