app/controllers/users_controller.rb

INSERT INTO `users` (`salt`, `single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `username`, `failed_login_count`, `current_login_ip`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `last_login_at`, `email`) VALUES('Ct6Lu3oiR4I9W5Y1juvP', 'PcEmyHJYpePOWHgoQUV', '2010-11-03 13:44:26', '2010-11-03 13:44:26', 'd9fd7163cefb2c363fd1075c11990268274f69e8b47bd26f69305d93444a8011a42771d2345c81f0464d8160b8869dbd0b5d793048a455db92cbf0f85ef6e23b', 'ogRGYf53BltB6SfWVXKJ', '2010-11-03 13:44:26', 'javagg', 0, '127.0.0.1', '2010-11-03 13:44:26', '937fdf5863d180b88b3e8dec5b166fb8540e80b06bf6bc9aa0ba3a65172ee9ce94429f403ce8c8a0ab93b4c9c199b44e1f9d4eacec0bb744249751ba788ba809', 1, NULL, NULL, 'lu.lee05@gmail.com')
---
  def create
    @user = User.new(params[:user])

    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save_without_session_maintenance

DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user.delete!

UPDATE `users` SET `updated_at` = '2010-11-03 13:44:51', `crypted_password` = '67737c2a7aa39493c88ce19a0296f60a2b3227c6ad28bf4d6f23c8823682614d037ad0263a5e9e4670a6e78333477c022ad9f47c3d61a428a607e1ad1afc0de2', `salt` = 'LmqopqfKaK4RzJTaXCyg', `perishable_token` = 'AUBtMDtRjToXet1Cnv7', `last_login_at` = '2010-11-03 13:44:26', `last_login_ip` = '127.0.0.1', `current_login_at` = '2010-11-03 13:44:51', `login_count` = 2, `persistence_token` = 'cd4d04a0bca32acf362295f3e8d09780d13948b99dfb95f761876cd0c3feb6d7f53335f338dd2cf9f340000eaa673503c287a4982c16e501ad1c8601739e8354', `last_request_at` = '2010-11-03 13:44:51' WHERE `id` = 1
---
  def update
    @user = @current_user
    if @user.update_attributes(params[:user])